Validation_Cases/IncompressibleNACA0012/1514/Fine_SA/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.5890E-05;

boundaryField
{
    "(inlet|bottom)"
    {
        type            calculated;
        value           $internalField;
    }

    "(outlet|top)"
    {
        type            calculated;
        value           $internalField;
    }

    "(airfoilLower|airfoilUpper)"
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
